# Напишите программу, которая на вход
# принимает число и выдаёт его квадрат 

number = int(input('Введите число: ')) # упростили код убрав number = int(number)

print(f'Квадрат {number} равен: {number**2}')